let hanMyth =[
    {
        "id": "140001",
        "type": "Han",
        "node":"汉",
        "title":"纬书所记的感生神话",
        "intro": "记录神话和运用神话风气的发达，和春秋战国时代百家争鸣的学术空气是分不开的；到汉代初年淮南王刘安聚集门客撰写《淮南子》，太史公司马迁著《史记》的时候，这种发达的风气，也就临近尾声了。"
    },
    {
        "id": "140002",
        "type": "Han",
        "node":"汉",
        "title":"纬书所记的其他神话",
        "intro": "纬书除了记载为数不少的上古帝王的感生神话以外，还采撷记录了相当数量的一般神话的零星片断。"
    },
    {
        "id": "140003",
        "type": "Han",
        "node":"汉",
        "title":"《吴越春秋》、《越绝书》、《蜀王本纪》",
        "intro": "汉代有三部“杂史”性质的书，其中都有若干神话传说材料。一部是赵晔的《吴越春秋》，一部是袁康、吴平的《越绝书》，还有一部是已经亡佚的旧题为扬雄撰实际上恐怕是三国蜀谯周撰的《蜀王本纪》（徐中舒说）。"
    },
    {
        "id": "140004",
        "type": "Han",
        "node":"汉",
        "title":"《六韬》、《太公金匮》、《论衡》",
        "intro": "记述殷周之际带神话性质的历史故事的有《六韬》和《太公金匮》等。《六韬》也称《太公六韬》，和《太公金匮》并为《隋志》所著录，列在子部兵家。"
    },
    {
        "id": "140005",
        "type": "Han",
        "node":"汉",
        "title":"《风俗通义》、《三五历纪》",
        "intro": "汉代末年，另有一部书，以“辨风正俗”为宗旨，也含有反对迷信虚妄的色彩，和《论衡》的性质大略相近，只是态度比较温和，这就是应劭的《风俗通义》。原本三十一卷，今所传本只有十卷，佚亡的占了大半。"
    },
    {
        "id": "140006",
        "type": "Han",
        "node":"汉",
        "title":"《神异经》、《十洲记》、《洞冥记》",
        "intro": "汉人志怪著作中被疑为六朝人伪撰而托名的，主要有《神异经》、《十洲记》和《洞冥记》三部。"
    }
];

export
{
    hanMyth
}