let mythList = {
    100001:
        {
            "id": "100001",
            "type": "Primitive",
            "node": "原始",
            "title": "神话传说中的中国原始社会",
            "content": "整个原始社会，包含从猿人到古人的原始群居生活和新人出现以后从母系氏族公社、父系氏族公社到原始社会解体两大阶段。在母系氏族公社形成以前的这一阶段，时间是漫长的，大约经历了从200万年前到公元前4万年之久，我们叫它原始社会前期，相当于马克思在《摩尔根〈古代社会〉一书摘要》里所说的蒙昧时期的低级阶段和中级阶段。\n" +
                "        这段时期的历史，古代人们早已有所猜想和推测。庄周是最早一个在这方面作推想者。《庄子·胠箧》说：“昔者容成氏、大庭氏、伯皇氏、中央氏、栗陆氏、骊畜氏、轩辕氏、赫胥氏、尊卢氏、祝融氏、伏戏氏、神农氏，当是时也，民结绳而用之，甘其食，美其服，乐其俗，安其居，邻国相望，鸡狗之音相闻，民至老死而不相往来。”他从远古推想到伏戏（羲）、神农的时代，正是相当于早期母系氏族公社之时，所记诸古帝的名称，大概也有当时所传的一点古书作凭依，非纯出杜撰。但是，他把这段漫长的充满为生存与生活而斗争的原始人类群居生活的景象，描写得这样和平、丰足、安谧，则是道家清静无为而致天下太平思想的有色眼镜造成的错觉，是不可靠的。\n" +
                "《庄子》另一篇文章《盗跖》中，对原始社会的初期情景的推想，才比较接近实际：“古者禽兽多而人民少，于是民皆巢居以避之，昼拾橡栗，暮栖木上，故命之曰有巢氏之民。”《韩非子·五蠹》对此又有所补充，说：“上古之世，人民少而禽兽众，人民不胜禽兽虫蛇。有圣人作，构木为巢，以避群害，而民悦之，使王天下，号之曰有巢氏。”又说：“民食果蓏蜯蛤，腥臊臭恶，而伤害腹胃，民多疾病。有圣人作，钻燧取火以化腥臊，而民悦之，使王天下，号曰燧人氏。”从“构木为巢”到“钻燧取火”，概括了原始社会前期（相当于摩尔根分期法的蒙昧期低级阶段和中级阶段）社会生活的大略情景。可见古代人们对这段时期的原始社会仍是有比较正确的认识的。\n" +
                "也有纯出于神话性质推想的，如《汉唐地理书钞》所辑《荣氏遁甲开山图》便是。此书早佚，不知何代人所作，我估计大概也是汉代的纬书之一。《隋书·经籍志》有著录，列入子部的五行类，作“《遁甲开山图》三卷，荣氏撰”，其实该作“荣氏解”才更符合实际情况。《汉唐地理书钞》的辑者王谋说：“《荣氏遁甲开山图解》皆记天下名山古先神圣帝皇发迹之处，故以开山名书，即可以为地理书开宗第一章。”但观其辑存的关于三皇、伏羲、女娲等条目，实在也可算是古代的历史书，是将一些虚构的神人填充了原始社会最早时期的空白。例如关于三皇，书中就这么记载着——\n" +
                "五龙见教，天皇被迹望，在无外柱洲昆仑山上。解曰：五龙治在五方，为行神。五龙降天皇兄弟十二人，分五方，为十二部，法五龙之迹，行无为之化。天下仙圣，治在柱洲昆仑山上，无外之山，在昆仑东南一万二千里。五龙天皇，皆出此中，为十二时神也。五龙皇，后君也，昆弟四人，皆人面而龙身，长曰角龙，木仙也；次曰徵龙，火仙也；次曰商龙，金仙也；次曰羽龙，水仙也；父曰金龙，与诸子同得仙，治在五方。地皇兴于龙门熊耳山。解曰：地皇兄弟九人，面貌皆如女子，貌皆相类，蛇身兽足，生于龙门山中。\n" +
                "人皇起于刑马山。解曰：人皇兄弟九人，生于刑马山，身有九色。\n" +
                "接着是伏羲、女娲和女娲以下自大庭氏至无怀氏的古帝王名号，与《庄子·胠箧》所举，大体相同，或者便是本于《庄子》。其所异者，在《庄子》是把这些古帝王列在伏戏（羲）、神农以前，而《开山图》则把他们列在伏羲、女娲之后，而且还说从大庭氏到无怀氏，“凡十五代，皆袭庖羲（伏羲）之号”，不知何据，或者是别有所本吧。\n" +
                "总之不管怎样，这部书无非是以假想和虚拟，把荒古时代的景象，作了神话色彩的描述。从解说的辞语中，还可以看出，作者是受了道家清静无为和阴阳家阴阳五行思想的影响的。如果这也算是神话，当然是相当后起的神话，决非原始社会更非原始社会前期的神话。三国时，吴人徐整所作的《三五历纪》，在记盘古开天辟地之后，末有“后乃有三皇”一语，可知三皇是被安排在开天辟地的盘古之后的，可惜此书早佚，盘古之事也只是从后来的类书和书注中所引才能得见，竟未见到有关三皇的记叙。推想起来，或者仍是带着浓厚的神话色彩，如上所引《开山图》的记叙吧？用神话因素的东西来填补远古历史的空白，是道家之流和某些史学家的惯技。道士徐整已开其端，唐代司马贞《补三皇本纪》又继其后，而集此工作之大成者，乃是宋代罗泌所作的《路史》。《路史》分“前纪”和“后纪”两个部分，“前纪”从初三皇到无怀氏；“后纪”从太昊伏戏氏到夏少康，把许多神话传说材料都转化为历史，作了历史的安排和处理。这部书是很有意思的，包括从整个原始社会到奴隶社会初期的历程，可说是一部神话传说性质的原始社会史，书中所记叙的，当然就是历史化了的神话传说，但却很少有人对它做深入细致的研究。“属句遣字间，尚僻隐，易滋疑窦，每令人索解不得”（清赵承恩《新序》），是一个原因；“岁久传湮，原本无稽，而钱塘旧刻鲁鱼豕亥滋甚”（《重梓〈路史〉凡例》），又是一个原因；何况此书“其采典籍则五纬、百家、《山经》、道书，一言一事，靡不摭拾，几于驳杂而无伦”（明张鼎思《豫章刻路史前纪后纪序》）。以其难读又荒谬无凭，因而探究者少。我们从神话研究的角度看，此书倒是很值得注意的。它采取的神话材料，确实丰富，虽然把它们都转化作了历史，安排在一定的位置上，但从其子罗苹的注中，又每每把这些材料的来源一一注出，大致还其本来面貌，其间多有僻籍佚文不见于今世者，为我们提供了考察、采撷神话材料的方便。《路史》的“前纪”共分六纪，相当于原始社会前期群居生活阶段，“后纪”共有二纪，从伏羲、女娲开始到夏少康中兴，相当于原始社会后期母系制氏族公社建立到原始社会解体，奴隶制社会初步形成阶段。罗泌将史前的这数十百万年的人类历史作了神话性质的推想，取材宏博，构思奇伟。尤有奇者，是他所分前、后二纪，竟恰恰暗合原始社会的两个重要发展阶段。神话传说——即使是经过整理安排的神话传说——之足为“史影”，看来具有一定的道理。\n" +
                "“前纪”六纪所收古帝名号共五十七，较之《庄子》所举，四倍有余，把一些河神、山神乃至古仙人如巨灵氏、谯明氏、涿光氏、犁灵氏、大氏、弇兹氏、泰逢氏、云阳氏等都列入了古帝的行列，看来自然是舛驳不伦。但是，这一大队古帝的名号，却给我们暗示出了原始社会前期的时间之长，正如李白《蜀道难》一诗所说：“蚕丛及鱼凫，开国何茫然，迩来四万八千年……”；又从所举人神不分的古帝中，给我们暗示出了处于蒙昧时期的原始先民群居生活的某些侧影。\n" +
                "但这仅仅是从神话传说材料中反映出的中国原始社会，尤其是它前期的一些情况的侧影，却并不是这一时期的神话。"
        },
    100002:
        {
            "id": "100002",
            "type": "Primitive",
            "node": "原始",
            "title": "萌芽状态神话的产生时期",
            "content": "这个时期有没有神话呢？回答是肯定的。不过得先把“神话”一词的概念弄明白。“神话”一词，中国古来原是没有的。这个词语大概是从西欧被翻译到日本，然后又从日本移植到中国来的。"
        },
    100003:
        {
            "id": "100003",
            "type": "Primitive",
            "node": "原始",
            "title": "前万物有灵论：活物论时期的神话",
            "content": "刚从动物脱离出来的原始人类，开始制造并学会使用简单粗陋的工具，从事集体劳动生产，在生产过程中，逐步使分节语言发展完善起来，借以交流经验，表达思想感情，并借此从事简单幼稚的原始思维活动。这种思维活动的特征，乃是以好奇为基因，把外界的一切东西，不管是生物或非生物、自然力或自然现象，都看作是和自己相同的有生命、有意志的活物。"
        },
    100004:
        {
            "id": "100004",
            "type": "Primitive",
            "node": "原始",
            "title": "活物论时期神话的遗迹",
            "content": "《山海经》是一部保存神话资料最丰富的书，就其资料的性质来看，也比较接近原始本来面貌。但那里面所能见到的，已几乎全是万物有灵论时期以后自然崇拜、图腾崇拜……的神话，所有神灵和精怪，大都是半人半兽的模样，这便是对原始自然神初步的拟人化。"
        }
};


export {
    mythList
}