let preqinMyth =[
    {
        "id": "130001",
        "type": "Preqin",
        "node":"先秦",
        "title":"《穆天子传》、《诗经》与《楚辞》",
        "intro": "《穆天子传》是先秦时代一部重要的古籍，人们每每将它和《山海经》对举，陶潜《读山海经》诗有“泛览《周王传》，流观《山海图》”这样的语句，即其一例。"
    },
    {
        "id": "130002",
        "type": "Preqin",
        "node":"先秦",
        "title":"宋玉的《高唐赋》与《神女赋》",
        "intro": "《楚辞》的另外一个重要作者是宋玉，传说他是屈原的弟子，《九辩》是他所作，然而里面并没有什么神话材料。倒是《文选》所载宋玉的《高唐赋》和《神女赋》，为我们写出了一个重要的神话人物瑶姬，并且最早提供了有关她的神话材料"
    },
    {
        "id": "130003",
        "type": "Preqin",
        "node":"先秦",
        "title":"古史中的神话（上）",
        "intro": "先秦及汉初的神话材料，在历史学家和哲学家的著作中也保存有不少，有的可以作为《山海经》神话材料的补充，有的则是独立的神话片断。一般情况是，这些神话材料经过历史学家和哲学家运用以后，往往便被历史化和哲学化了，有的化得还相当厉害，甚至弄得几乎面目全非。"
    },
    {
        "id": "130004",
        "type": "Preqin",
        "node":"先秦",
        "title":"古史中的神话（下）",
        "intro": "和《左传》性质相近的《国语》，其中也有若干神话材料。最著名的就是孔子回答吴国使者问“骨何为大”的那一段，禹诛防风的神话，此为首见，赖有孔子答客问而得保存。"
    },
    {
        "id": "130005",
        "type": "Preqin",
        "node":"先秦",
        "title":"诸子中的神话（上）",
        "intro": "战国时代，有两部关系神话而已佚亡的古书，值得在这里一提。一部叫《归藏》，另一部叫《琐语》，其性质都是属于卜筮占梦方面的记述。"
    },
    {
        "id": "130006",
        "type": "Preqin",
        "node":"先秦",
        "title":"诸子中的神话（下）",
        "intro": "属于墨家著作的《墨子》和《晏子春秋》里也保存了一些神话材料的片断，虽然它们都各自染有一些宗教迷信的色彩，降低了神话本身的价值。"
    },
    {
        "id": "130007",
        "type": "Preqin",
        "node":"先秦",
        "title":"《世本》、《尔雅》与《说文》",
        "intro": "秦末汉初，还有两部有关神话研究的书，值得提出来大略讲讲，一部是历史类的《世本》，一部是小学类的《尔雅》。《世本》在南宋时就佚亡了。"
    }
];

export
{
    preqinMyth
}