let primitiveMyth =[
    {
        "id": "100001",
        "type": "Primitive",
        "node":"原始",
        "title":"神话传说中的中国原始社会",
        "intro": "整个原始社会，包含从猿人到古人的原始群居生活和新人出现以后从母系氏族公社、父系氏族公社到原始社会解体两大阶段。在母系氏族公社形成以前的这一阶段，时间是漫长的，大约经历了从200万年前到公元前4万年之久，我们叫它原始社会前期，相当于马克思在《摩尔根〈古代社会〉一书摘要》里所说的蒙昧时期的低级阶段和中级阶段。"
    },
    {
        "id": "100002",
        "type": "Primitive",
        "node":"原始",
        "title":"萌芽状态神话的产生时期",
        "intro": "这个时期有没有神话呢？回答是肯定的。不过得先把“神话”一词的概念弄明白。“神话”一词，中国古来原是没有的。这个词语大概是从西欧被翻译到日本，然后又从日本移植到中国来的。"
    },
    {
        "id": "100003",
        "type": "Primitive",
        "node":"原始",
        "title":"前万物有灵论：活物论时期的神话",
        "intro": "刚从动物脱离出来的原始人类，开始制造并学会使用简单粗陋的工具，从事集体劳动生产，在生产过程中，逐步使分节语言发展完善起来，借以交流经验，表达思想感情，并借此从事简单幼稚的原始思维活动。这种思维活动的特征，乃是以好奇为基因，把外界的一切东西，不管是生物或非生物、自然力或自然现象，都看作是和自己相同的有生命、有意志的活物。"
    },
    {
        "id": "100004",
        "type": "Primitive",
        "node":"原始",
        "title":"活物论时期神话的遗迹",
        "intro": "《山海经》是一部保存神话资料最丰富的书，就其资料的性质来看，也比较接近原始本来面貌。但那里面所能见到的，已几乎全是万物有灵论时期以后自然崇拜、图腾崇拜……的神话，所有神灵和精怪，大都是半人半兽的模样，这便是对原始自然神初步的拟人化。"
    }
];

export
{
    primitiveMyth
}