let shanhaiching1Myth =[
    {
        "id": "110001",
        "type": "Shanhaiching-1",
        "node":"山海经",
        "title":"《山海经》神话的上下限",
        "intro": "保存神话资料最丰富的一部书，自然不能不首推《山海经》。《山海经》旧传为夏禹、伯益所作，而夏禹、伯益本身已是神话人物，如何能作出这样一部书，故这种说法是不足凭信的。"
    },
    {
        "id": "110002",
        "type": "Shanhaiching-1",
        "node":"山海经",
        "title":"自然崇拜与图腾崇拜神话",
        "intro": "《山海经》所记的诸神，大都是宗教的神，是从自然崇拜开端的。《五藏山经》每经末尾祀典部分记有诸山山神的形貌，有作鸟身龙首的，有作龙身鸟首的，有作龙身人面的......"
    },
    {
        "id": "110003",
        "type": "Shanhaiching-1",
        "node":"山海经",
        "title":"女性开辟神的神话",
        "intro": "马克思在《摘要》一书中所说：在野蛮时期的低级阶段，……开始于此时产生神话。那时约相当于原始氏族社会母权制的晚期，即新石器时代，恐怕已不是神话开始产生的阶段而是神话发展的阶段了。"
    },
    {
        "id": "110004",
        "type": "Shanhaiching-1",
        "node":"山海经",
        "title":"构成《山海经》神话的主要部分",
        "intro": "男性的神和神性的英雄开始受到注意而被歌颂，是从原始氏族社会母权制到父权制，乃至父权制确立以后才有的事。构成《山海经》神话的主要部分，便是男性神与自然及社会进行斗争的若干宏丽的图片。"
    }
];

export
{
    shanhaiching1Myth
}