let shanhaiching2Myth =[
    {
        "id": "120001",
        "type": "Shanhaiching-2",
        "node":"山海经",
        "title":"天帝的出现和天地通路的隔绝",
        "intro": "从原始社会到奴隶社会，有个过渡时期，那就是氏族制逐渐解体，逐渐向着国家发展，并且逐渐在社会内部划分为剥削和被剥削两个敌对的阶级。这个时期的某些特征在神话上也有所反映，例如天帝的出现，天和地通路的隔绝，等等。"
    },
    {
        "id": "120002",
        "type": "Shanhaiching-2",
        "node":"山海经",
        "title":"帝俊在《山海经》中的地位",
        "intro": "帝俊在《山海经》中也和黄帝一样，是非常显赫的大神。他是东方殷民族奉祀的上帝，也是殷民族奉祀的始祖神，卜辞中经常提到的“夋”或“高祖夋”就是他。"
    },
    {
        "id": "120003",
        "type": "Shanhaiching-2",
        "node":"山海经",
        "title":"诸神子孙的创造发明和怪物异人",
        "intro": "《山海经》神话中，有许多是记叙诸神子孙的创造发明的，即所谓文化英雄的神话。前面所举帝俊神话的零片中，不少的记叙，就是属于这种性质的。"
    },
    {
        "id": "120004",
        "type": "Shanhaiching-2",
        "node":"山海经",
        "title":"西王母神话的演变",
        "intro": "《山海经》所记叙的众多神人当中，西王母是对后世产生影响最大的。尽管人们可以不知道有黄帝、帝俊、颛顼等大神，但却几乎没有不知道有西王母即王母娘娘的。而这却是产生于流传演变过程中的误解，并非对《山海经》的西王母有真正的认识或对他感兴趣。"
    },
    {
        "id": "120005",
        "type": "Shanhaiching-2",
        "node":"山海经",
        "title":"从朴野到文明的昆仑山",
        "intro": "在《山海经》的记叙中，有一座像希腊神话中奥林帕司山那样庄严巍峨的大山，就是昆仑山；那是“帝之下都”，是“百神之所在”的地方。"
    }
];

export
{
    shanhaiching2Myth
}