let book = {
    "categories": [
        "中国上古人物",
        "中国神祇",
        "巨人"
    ],
    "image": [
        "https://upload.wikimedia.org/wikipedia/commons/1/13/Kua-fu.gif"
    ],
    "summary": [
        {
            "books": [],
            "pieces": [
                "夸父，中国神话人物。其中「夸」指高大，「父」指男子，字面意义即是高大的男子。"
            ]
        },
        {
            "books": [
                "山海经"
            ],
            "pieces": [
                "夸父是",
                "#",
                "中记载的巨人，立志追赶太阳，终未及，半道渴死，是太阳崇拜的神话故事。"
            ]
        },
        {
            "books": [
                "山海经",
                "西山经",
                "北山经",
                "东山经",
                "中山经",
                "海外北经",
                "大荒东经",
                "大荒北经"
            ],
            "pieces": [
                "夸父源自",
                "#",
                "，在",
                "#",
                "、",
                "#",
                "、",
                "#",
                "、",
                "#",
                "、",
                "#",
                "、",
                "#",
                "、",
                "#",
                "中都有出现。"
            ]
        },
        {
            "books": [
                "山海经·大荒北经",
                "山海经·海外北经",
                "荆州记",
                "山海经·西山经"
            ],
            "pieces": [
                "",
                "#",
                "载：“大荒之中，有山名曰成都载天。有人珥两黄蛇，把两黄蛇，名曰夸父。后士生信，信生夸父。夸父不量力，欲追日景，逮之于禺谷。将饮河而不足也，将走大泽，未至，死于此。”另外",
                "#",
                "亦载：“夸父与日逐走，入日。渴欲得饮，饮于河、渭。河、渭不足，北饮大泽。未至，道渴而死。弃其杖，化为邓林（桃林）。”后有成语“夸父追日”。",
                "#",
                "有“零陵县石上有夸父迹”。",
                "#",
                "：“有兽焉，其状如禺而文臂，豹虎（尾）而兽投，名曰举父。”这里的举父就是夸父。一说夸父即帝榆罔，大约与黄帝同时，是末代的炎帝。"
            ]
        },
        {
            "books": [],
            "pieces": [
                "炎帝氏族传到帝榆罔时，诸侯相侵伐，暴虐百姓，以九黎族最凶悍，而帝榆罔弗能征。榆罔，犹如禺王，即猴王。"
            ]
        },
        {
            "books": [
                "山海经",
                "大荒北经"
            ],
            "pieces": [
                "关于",
                "#",
                "记载夸父事迹有众多版本，甚至是相互矛盾。例如",
                "#",
                "载：“夸父不量力，欲追日景，逮之于禺谷。捋饮河而不足也，将走大泽，未至，死于此。”接著又说“应龙已杀蚩尤，又杀夸父”，说是应龙杀了蚩尤和夸父。"
            ]
        },
        {
            "books": [],
            "pieces": [
                "因此夸父的死法有两种：渴死，或是被应龙杀。因此有学者以为夸父是一个部落。"
            ]
        },
        {
            "books": [],
            "pieces": [
                "茅盾认为：“‘夸父’是一个族名，等于希腊的提坦。”又一说夸父族曾与蚩尤部落共同对抗黄帝部落，后来被黄帝的大将应龙打败。"
            ]
        },
        {
            "books": [
                "竹书记年"
            ],
            "pieces": [
                "",
                "#",
                "纪载，夸父为丹朱的得力大将，夸父善于奔逐，专门替丹朱传送信件。"
            ]
        }
    ],
    "title": "夸父"
}

export {
    book
}