let nodes = `[
{
"id": "100001",
"type": "Primitive",
"node":"原始",
"title":"原始社会前期的神话",
"intro": "整个原始社会，包含从猿人到古人的原始群居生活和新人出现以后从母系氏族公社、父系氏族公社到原始社会解体两大阶段。在母系氏族公社形成以前的这一阶段，时间是漫长的，大约经历了从200万年前到公元前4万年之久，我们叫它原始社会前期，相当于马克思在《摩尔根〈古代社会〉一书摘要》里所说的蒙昧时期的低级阶段和中级阶段。",
"font":"JiaGuWen"
},
{
"id": "100002",
"type": "Shanhaiching-1",
"node":"山海经",
"title":"《山海经》的神话（上）",
"intro":"保存神话资料最丰富的一部书，自然不能不首推《山海经》。《山海经》旧传为夏禹、伯益所作，而夏禹、伯益本身已是神话人物，如何能作出这样一部书，故这种说法是不足凭信的。它实际上是在相当长一段时期内，众多无名氏的作品。根据我的初步考察，此书大概是从战国初年到汉代初年的楚国或楚地人所作。",
"font":"JiaGuWen"
},
{
"id": "100003",
"type": "Shanhaiching-2",
"node":"山海经",
"title":"《山海经》的神话（下）",
"intro":"从原始社会到奴隶社会，有个过渡时期，那就是氏族制逐渐解体，逐渐向着国家发展，并且逐渐在社会内部划分为剥削和被剥削两个敌对的阶级。这个时期的某些特征在神话上也有所反映，例如天帝的出现，天和地通路的隔绝，等等。",
"font":"JiaGuWen"
},
{
"id": "100004",
"type": "Preqin",
"node":"先秦",
"title":"先秦及汉初文献中的神话",
"intro":"《穆天子传》是先秦时代一部重要的古籍，人们每每将它和《山海经》对举，陶潜《读山海经》诗有“泛览《周王传》，流观《山海图》”这样的语句，即其一例。",
"font":"JiaGuWen"
},
{
"id": "100005",
"type": "Han",
"node":"汉",
"title":"汉代的感生神话及其他",
"intro":"记录神话和运用神话风气的发达，和春秋战国时代百家争鸣的学术空气是分不开的；到汉代初年淮南王刘安聚集门客撰写《淮南子》，太史公司马迁著《史记》的时候，这种发达的风气，也就临近尾声了。",
"font":"ZhuanShu"
},
{
"id": "100006",
"type": "Buddhas",
"node":"仙佛",
"title":"仙话及佛典中的神话",
"intro":"在中国古代，有一种和神话同属幻想虚构、然而性质却比较特殊的故事，这种故事以寻求长生不死途径为中心内容，进而幻想人能和仙人们打交道，最终在仙人们的导引下升天。故事的大体模式虽是这样，表现出来的面貌仍是多种多样，丰富多彩。这种故事，我们叫它做仙话。",
"font":"KaiShu"
},
{
"id": "100007",
"type": "Personage",
"node":"人物",
"title":"历史人物的神话",
"intro":"研究神话，有一个需要予以解决的问题，就是神话人物本身性质的问题。不能简单地判定，神话人物都是虚构的。不，问题不会这样简单。",
"font":"KaiShu"
},
{
"id": "100008",
"type": "WeiJin-1",
"node":"魏晋",
"title":"魏晋六朝的神话（上）",
"intro":"鲁迅《中国小说史略》第五篇“六朝之鬼神志怪书（上）”说：“中国本信巫，神仙之说盛行，汉末又大畅巫风，而鬼道愈炽；会小乘佛教亦入中土，渐见流传。凡此，皆张皇鬼神，称道灵异，故自晋讫隋，特多鬼神志怪之书。其中有出于文人者，有出于教徒者。",
"font":"Song"
},
{
"id": "100009",
"type": "WeiJin-2",
"node":"魏晋",
"title":"魏晋六朝的神话（下）",
"intro":"在魏晋六朝的志怪书中，晋王嘉著、梁萧绮录的《拾遗记》是别具一格的书。它把许多神话性质的东西，附托在从开辟以来“春皇庖牺”算起到西晋末年为止的历史人物身上，也算它是历史。",
"font":"Song"
},
{
"id": "100010",
"type": "WeiJin-2",
"node":"魏晋",
"title":"魏晋六朝的神话（下）",
"intro":"在魏晋六朝的志怪书中，晋王嘉著、梁萧绮录的《拾遗记》是别具一格的书。它把许多神话性质的东西，附托在从开辟以来“春皇庖牺”算起到西晋末年为止的历史人物身上，也算它是历史。",
"font":"Song"
},
{
"id": "100011",
"type": "Tang",
"node":"唐",
"title":"唐五代的神话",
"intro":"中国神话发展到了唐代，便产生了一些新的变化。唐以前的神话，大体是以笔记体的形式，作朴质的记录，保存在书本上。到了唐代，其中一支还沿袭着以往的道路，以笔记体的形式记录着往古的神话和新产生的神话；而另外一支则以一些神话传说作为材料，开始有意识地写作神话小说。",
"font":"Song"
},
{
"id": "100012",
"type": "SongYuan",
"node":"宋元",
"title":"宋元的神话",
"intro":"中国的神话，到了宋元时代，民间口传的神话，逐渐有了发展，而文人记录或根据一些神话材料写作的神话小说或神话故事，却呈现出明显的衰退状态。",
"font":"Song"
},
{
"id": "100013",
"type": "MingQing",
"node":"明清",
"title":"明清的神话",
"intro":"明代志怪书中，有一部神话传说材料相当丰富的书，就是桑怿的《琅嬛记》，凡三卷。明代具有神话色彩的小说，共有三部：一部是吴承恩的《西游记》，一部是许仲琳的《封神演义》，还有一部是余象斗编的《四游记》。",
"font":"Song"
},
{
"id": "100014",
"type": "Minjian",
"node":"民间",
"title":"民间流传的神话",
"intro":"多数神话，虽然早在民间流传，一经文人记录，便已比较完整、比较定型，如唐赵耕《张龙公碑》记叙的张龙公神话、五代杜光庭《墉城集仙录》记叙的瑶姬神话、宋吴曾《能改斋漫录》记叙的祠山张大帝神话，等等，都是。",
"font":"Song"
}
]`;

const nodeColors = ["red", "pink", "purple", "deep-purple",
    "indigo", "blue", "light-blue", "cyan", "teal",
    "green", "light-green", "lime", "amber", "orange",
    "deep-orange", "brown", "blue-grey", "grey"];

export {
    nodes,
    nodeColors
}